In [4]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [6]:
pd.DataFrame(randn(5,4),['A','B','C','D','E'],['1','2','3','4'])

          1         2         3         4
A -0.579051 -0.435242 -1.896622 -1.353671
B -2.114372  0.641481 -1.815166 -0.064915
C  0.567479 -0.050509  0.363368  0.191672
D -1.049278  0.266561 -0.189124  0.074415
E -1.025613  1.678393 -0.797689  0.414735

In [9]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['1','2','3','4'])

In [10]:
df

          1         2         3         4
A  1.548185 -0.283637  0.399484 -0.480869
B -1.483027 -0.233343  1.382020 -0.184963
C  0.412030  0.318512 -0.151064 -0.431365
D  0.444518 -0.087557  0.291090  3.050868
E  0.403809 -0.386385  1.175678 -0.111921

In [8]:
df.drop('E',axis=0)

          1         2         3         4
A  1.280795 -1.603172  1.224482  0.198255
B -1.025945  1.063628 -0.520137 -0.585861
C -0.661791  0.435307  1.297282 -1.463527
D -0.797151  0.064169  0.808847 -0.099595

In [ ]:
num = np.random.randn

In [2]:
import pandas as pd
data = pd.read_html('google.com')

ValueError: No tables found

In [3]:
f_states=   pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')

In [4]:
f_states

[               0               1               2                  3
 0   Abbreviation      State Name         Capital     Became a State
 1             AL         Alabama      Montgomery  December 14, 1819
 2             AK          Alaska          Juneau    January 3, 1959
 3             AZ         Arizona         Phoenix  February 14, 1912
 4             AR        Arkansas     Little Rock      June 15, 1836
 5             CA      California      Sacramento  September 9, 1850
 6             CO        Colorado          Denver     August 1, 1876
 7             CT     Connecticut        Hartford    January 9, 1788
 8             DE        Delaware           Dover   December 7, 1787
 9             FL         Florida     Tallahassee      March 3, 1845
 10            GA         Georgia         Atlanta    January 2, 1788
 11            HI          Hawaii        Honolulu    August 21, 1959
 12            ID           Idaho           Boise       July 3, 1890
 13            IL        Illinois     Springfield   December 3, 1818
 14            IN         Indiana    Indianapolis  December 11, 1816
 15            IA            Iowa      Des Moines  December 28, 1846
 16            KS          Kansas          Topeka   January 29, 1861
 17            KY        Kentucky       Frankfort       June 1, 1792
 18            LA       Louisiana     Baton Rouge     April 30, 1812
 19            ME           Maine         Augusta     March 15, 1820
 20            MD        Maryland       Annapolis     April 28, 1788
 21            MA   Massachusetts          Boston   February 6, 1788
 22            MI        Michigan         Lansing   January 26, 1837
 23            MN       Minnesota      Saint Paul       May 11, 1858
 24            MS     Mississippi         Jackson  December 10, 1817
 25            MO        Missouri  Jefferson City    August 10, 1821
 26            MT         Montana          Helena   November 8, 1889
 27            NE        Nebraska         Lincoln      March 1, 1867
 28            NV          Nevada     Carson City   October 31, 1864
 29            NH   New Hampshire         Concord      June 21, 1788
 30            NJ      New Jersey         Trenton  December 18, 1787
 31            NM      New Mexico        Santa Fe    January 6, 1912
 32            NY        New York          Albany      July 26, 1788
 33            NC  North Carolina         Raleigh  November 21, 1789
 34            ND    North Dakota        Bismarck   November 2, 1889
 35            OH            Ohio        Columbus      March 1, 1803
 36            OK        Oklahoma   Oklahoma City  November 16, 1907
 37            OR          Oregon           Salem  February 14, 1859
 38            PA    Pennsylvania      Harrisburg  December 12, 1787
 39            RI    Rhode Island      Providence       May 19, 1790
 40            SC  South Carolina        Columbia       May 23, 1788
 41            SD    South Dakota          Pierre   November 2, 1889
 42            TN       Tennessee       Nashville       June 1, 1796
 43            TX           Texas          Austin  December 29, 1845
 44            UT            Utah  Salt Lake City    January 4, 1896
 45            VT         Vermont      Montpelier      March 4, 1791
 46            VA        Virginia        Richmond      June 25, 1788
 47            WA      Washington         Olympia  November 11, 1889
 48            WV   West Virginia      Charleston      June 20, 1863
 49            WI       Wisconsin         Madison       May 29, 1848
 50            WY         Wyoming        Cheyenne      July 10, 1890,
                                                 0  \
 0  v t e Political divisions of the United States
 1                                          States
 2                                National capital
 3                                   Large islands
 4                                   Small islands

                                                    1
 0                                                NaN
 1  Alabama · Alaska · Arizona · Arkansas · Califo...
 2                               District of Columbia
 3  American Samoa · Guam · Northern Mariana Islan...
 4  Baker Island · Howland Island · Jarvis Island ...  ]

In [6]:
import html5lib
import lxml
import BeautifulSoup4

ModuleNotFoundError: No module named 'BeautifulSoup4'